apache/nuttx/arch/arm/src/s32k1xx/hardware/s32k1xx_enet.h
/*****************************************************************************
 * arch/arm/src/s32k1xx/hardware/s32k1xx_enet.h
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 *****************************************************************************/

#ifndef __ARCH_ARM_SRC_S32K1XX_HARDWARE_S32K1XX_ENET_H
#define __ARCH_ARM_SRC_S32K1XX_HARDWARE_S32K1XX_ENET_H

/*****************************************************************************
 * Included Files
 *****************************************************************************/

#include <nuttx/config.h>
#include "hardware/s32k1xx_memorymap.h"

/*****************************************************************************
 * Pre-processor Definitions
 *****************************************************************************/

/* Register Offsets **********************************************************/

#define S32K1XX_ENET_EIR_OFFSET      0x0004 /* Interrupt Event Register */
#define S32K1XX_ENET_EIMR_OFFSET     0x0008 /* Interrupt Mask Register */
#define S32K1XX_ENET_RDAR_OFFSET     0x0010 /* Receive Descriptor Active Register */
#define S32K1XX_ENET_TDAR_OFFSET     0x0014 /* Transmit Descriptor Active Register */
#define S32K1XX_ENET_ECR_OFFSET      0x0024 /* Ethernet Control Register */
#define S32K1XX_ENET_MMFR_OFFSET     0x0040 /* MII Management Frame Register */
#define S32K1XX_ENET_MSCR_OFFSET     0x0044 /* MII Speed Control Register */
#define S32K1XX_ENET_MIBC_OFFSET     0x0064 /* MIB Control Register */
#define S32K1XX_ENET_RCR_OFFSET      0x0084 /* Receive Control Register */
#define S32K1XX_ENET_TCR_OFFSET      0x00c4 /* Transmit Control Register */
#define S32K1XX_ENET_PALR_OFFSET     0x00e4 /* Physical Address Lower Register */
#define S32K1XX_ENET_PAUR_OFFSET     0x00e8 /* Physical Address Upper Register */
#define S32K1XX_ENET_OPD_OFFSET      0x00ec /* Opcode/Pause Duration Register */
#define S32K1XX_ENET_IAUR_OFFSET     0x0118 /* Descriptor Individual Upper Address Register */
#define S32K1XX_ENET_IALR_OFFSET     0x011c /* Descriptor Individual Lower Address Register */
#define S32K1XX_ENET_GAUR_OFFSET     0x0120 /* Descriptor Group Upper Address Register */
#define S32K1XX_ENET_GALR_OFFSET     0x0124 /* Descriptor Group Lower Address Register */
#define S32K1XX_ENET_TFWR_OFFSET     0x0144 /* Transmit FIFO Watermark Register */
#define S32K1XX_ENET_RDSR_OFFSET     0x0180 /* Receive Descriptor Ring Start Register */
#define S32K1XX_ENET_TDSR_OFFSET     0x0184 /* Transmit Buffer Descriptor Ring Start Register */
#define S32K1XX_ENET_MRBR_OFFSET     0x0188 /* Maximum Receive Buffer Size Register */
#define S32K1XX_ENET_RSFL_OFFSET     0x0190 /* Receive FIFO Section Full Threshold */
#define S32K1XX_ENET_RSEM_OFFSET     0x0194 /* Receive FIFO Section Empty Threshold */
#define S32K1XX_ENET_RAEM_OFFSET     0x0198 /* Receive FIFO Almost Empty Threshold */
#define S32K1XX_ENET_RAFL_OFFSET     0x019c /* Receive FIFO Almost Full Threshold */
#define S32K1XX_ENET_TSEM_OFFSET     0x01a0 /* Transmit FIFO Section Empty Threshold */
#define S32K1XX_ENET_TAEM_OFFSET     0x01a4 /* Transmit FIFO Almost Empty Threshold */
#define S32K1XX_ENET_TAFL_OFFSET     0x01a8 /* Transmit FIFO Almost Full Threshold */
#define S32K1XX_ENET_TIPG_OFFSET     0x01ac /* Transmit Inter-Packet Gap */
#define S32K1XX_ENET_FTRL_OFFSET     0x01b0 /* Frame Truncation Length */
#define S32K1XX_ENET_TACC_OFFSET     0x01c0 /* Transmit Accelerator Function Configuration */
#define S32K1XX_ENET_RACC_OFFSET     0x01c4 /* Receive Accelerator Function Configuration */

/* REVISIT:  Missing statistics register */

#define S32K1XX_ENET_ATCR_OFFSET     0x0400 /* Timer Control Register */
#define S32K1XX_ENET_ATVR_OFFSET     0x0404 /* Timer Value Register */
#define S32K1XX_ENET_ATOFF_OFFSET    0x0408 /* Timer Offset Register */
#define S32K1XX_ENET_ATPER_OFFSET    0x040c /* Timer Period Register */
#define S32K1XX_ENET_ATCOR_OFFSET    0x0410 /* Timer Correction Register */
#define S32K1XX_ENET_ATINC_OFFSET    0x0414 /* Time-Stamping Clock Period Register */
#define S32K1XX_ENET_ATSTMP_OFFSET   0x0418 /* Timestamp of Last Transmitted Frame */

#define S32K1XX_ENET_TGSR_OFFSET     0x0604 /* Timer Global Status Register */
#define S32K1XX_ENET_TCSR0_OFFSET    0x0608 /* Timer Control Status Register */
#define S32K1XX_ENET_TCCR0_OFFSET    0x060c /* Timer Compare Capture Register */
#define S32K1XX_ENET_TCSR1_OFFSET    0x0610 /* Timer Control Status Register */
#define S32K1XX_ENET_TCCR1_OFFSET    0x0614 /* Timer Compare Capture Register */
#define S32K1XX_ENET_TCSR2_OFFSET    0x0618 /* Timer Control Status Register */
#define S32K1XX_ENET_TCCR2_OFFSET    0x061c /* Timer Compare Capture Register */
#define S32K1XX_ENET_TCSR3_OFFSET    0x0620 /* Timer Control Status Register */
#define S32K1XX_ENET_TCCR3_OFFSET    0x0624 /* Timer Compare Capture Register */

/* Register Addresses ********************************************************/

#define S32K1XX_ENET_EIR             (S32K1XX_ENET_BASE+S32K1XX_ENET_EIR_OFFSET)
#define S32K1XX_ENET_EIMR            (S32K1XX_ENET_BASE+S32K1XX_ENET_EIMR_OFFSET)
#define S32K1XX_ENET_RDAR            (S32K1XX_ENET_BASE+S32K1XX_ENET_RDAR_OFFSET)
#define S32K1XX_ENET_TDAR            (S32K1XX_ENET_BASE+S32K1XX_ENET_TDAR_OFFSET)
#define S32K1XX_ENET_ECR             (S32K1XX_ENET_BASE+S32K1XX_ENET_ECR_OFFSET)
#define S32K1XX_ENET_MMFR            (S32K1XX_ENET_BASE+S32K1XX_ENET_MMFR_OFFSET)
#define S32K1XX_ENET_MSCR            (S32K1XX_ENET_BASE+S32K1XX_ENET_MSCR_OFFSET)
#define S32K1XX_ENET_MIBC            (S32K1XX_ENET_BASE+S32K1XX_ENET_MIBC_OFFSET)
#define S32K1XX_ENET_RCR             (S32K1XX_ENET_BASE+S32K1XX_ENET_RCR_OFFSET)
#define S32K1XX_ENET_TCR             (S32K1XX_ENET_BASE+S32K1XX_ENET_TCR_OFFSET)
#define S32K1XX_ENET_PALR            (S32K1XX_ENET_BASE+S32K1XX_ENET_PALR_OFFSET)
#define S32K1XX_ENET_PAUR            (S32K1XX_ENET_BASE+S32K1XX_ENET_PAUR_OFFSET)
#define S32K1XX_ENET_OPD             (S32K1XX_ENET_BASE+S32K1XX_ENET_OPD_OFFSET)
#define S32K1XX_ENET_IAUR            (S32K1XX_ENET_BASE+S32K1XX_ENET_IAUR_OFFSET)
#define S32K1XX_ENET_IALR            (S32K1XX_ENET_BASE+S32K1XX_ENET_IALR_OFFSET)
#define S32K1XX_ENET_GAUR            (S32K1XX_ENET_BASE+S32K1XX_ENET_GAUR_OFFSET)
#define S32K1XX_ENET_GALR            (S32K1XX_ENET_BASE+S32K1XX_ENET_GALR_OFFSET)
#define S32K1XX_ENET_TFWR            (S32K1XX_ENET_BASE+S32K1XX_ENET_TFWR_OFFSET)
#define S32K1XX_ENET_RDSR            (S32K1XX_ENET_BASE+S32K1XX_ENET_RDSR_OFFSET)
#define S32K1XX_ENET_TDSR            (S32K1XX_ENET_BASE+S32K1XX_ENET_TDSR_OFFSET)
#define S32K1XX_ENET_MRBR            (S32K1XX_ENET_BASE+S32K1XX_ENET_MRBR_OFFSET)
#define S32K1XX_ENET_RSFL            (S32K1XX_ENET_BASE+S32K1XX_ENET_RSFL_OFFSET)
#define S32K1XX_ENET_RSEM            (S32K1XX_ENET_BASE+S32K1XX_ENET_RSEM_OFFSET)
#define S32K1XX_ENET_RAEM            (S32K1XX_ENET_BASE+S32K1XX_ENET_RAEM_OFFSET)
#define S32K1XX_ENET_RAFL            (S32K1XX_ENET_BASE+S32K1XX_ENET_RAFL_OFFSET)
#define S32K1XX_ENET_TSEM            (S32K1XX_ENET_BASE+S32K1XX_ENET_TSEM_OFFSET)
#define S32K1XX_ENET_TAEM            (S32K1XX_ENET_BASE+S32K1XX_ENET_TAEM_OFFSET)
#define S32K1XX_ENET_TAFL            (S32K1XX_ENET_BASE+S32K1XX_ENET_TAFL_OFFSET)
#define S32K1XX_ENET_TIPG            (S32K1XX_ENET_BASE+S32K1XX_ENET_TIPG_OFFSET)
#define S32K1XX_ENET_FTRL            (S32K1XX_ENET_BASE+S32K1XX_ENET_FTRL_OFFSET)
#define S32K1XX_ENET_TACC            (S32K1XX_ENET_BASE+S32K1XX_ENET_TACC_OFFSET)
#define S32K1XX_ENET_RACC            (S32K1XX_ENET_BASE+S32K1XX_ENET_RACC_OFFSET)

#define S32K1XX_ENET_ATCR            (S32K1XX_ENET_BASE+S32K1XX_ENET_ATCR_OFFSET)
#define S32K1XX_ENET_ATVR            (S32K1XX_ENET_BASE+S32K1XX_ENET_ATVR_OFFSET)
#define S32K1XX_ENET_ATOFF           (S32K1XX_ENET_BASE+S32K1XX_ENET_ATOFF_OFFSET)
#define S32K1XX_ENET_ATPER           (S32K1XX_ENET_BASE+S32K1XX_ENET_ATPER_OFFSET)
#define S32K1XX_ENET_ATCOR           (S32K1XX_ENET_BASE+S32K1XX_ENET_ATCOR_OFFSET)
#define S32K1XX_ENET_ATINC           (S32K1XX_ENET_BASE+S32K1XX_ENET_ATINC_OFFSET)
#define S32K1XX_ENET_ATSTMP          (S32K1XX_ENET_BASE+S32K1XX_ENET_ATSTMP_OFFSET)

#define S32K1XX_ENET_TGSR            (S32K1XX_ENET_BASE+S32K1XX_ENET_TGSR_OFFSET)
#define S32K1XX_ENET_TCSR0           (S32K1XX_ENET_BASE+S32K1XX_ENET_TCSR0_OFFSET)
#define S32K1XX_ENET_TCCR0           (S32K1XX_ENET_BASE+S32K1XX_ENET_TCCR0_OFFSET)
#define S32K1XX_ENET_TCSR1           (S32K1XX_ENET_BASE+S32K1XX_ENET_TCSR1_OFFSET)
#define S32K1XX_ENET_TCCR1           (S32K1XX_ENET_BASE+S32K1XX_ENET_TCCR1_OFFSET)
#define S32K1XX_ENET_TCSR2           (S32K1XX_ENET_BASE+S32K1XX_ENET_TCSR2_OFFSET)
#define S32K1XX_ENET_TCCR2           (S32K1XX_ENET_BASE+S32K1XX_ENET_TCCR2_OFFSET)
#define S32K1XX_ENET_TCSR3           (S32K1XX_ENET_BASE+S32K1XX_ENET_TCSR3_OFFSET)
#define S32K1XX_ENET_TCCR3           (S32K1XX_ENET_BASE+S32K1XX_ENET_TCCR3_OFFSET)

/* Register Bit Definitions **************************************************/

